* TD41
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+NAME: ingest_meta
#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS: ingest_meta
#+begin_example
Borehole ID                           | td41
Descriptive Name                      | 
Area                                  | Paakitsoq
Data reference                        | Unknown PDF: See td1
Data DOI                              | 
Science reference                     | 
Science DOI                           | 
Date                                  | 1991-11-05
Longitude [°E]                        | -49.683
Latitude [°N]                         | 69.533
Location source                       | Unknown PDF: See td1
Depth of top measurement [m]          | 5.0
Depth of bottom measurement [m]       | 495.0
Ice thickness [m]                     | >600
Coverage [% of thickness]             | #VALUE!
Ice thickness source                  | Unknown PDF: See td1
Measured from: Top, Bottom, Relative  | T
General_Note                          | 
Temperature_note                      | 
Thickness_note                        | 
Location_note                         | 
#+end_example

** Temperature

+ See td1 Shallow88II.pdf

** Thickness

+ From PDF
 
** Location

+ From PDF

** Velocity

** Data                                                 :noexport:

#+NAME: ingest_data
#+BEGIN_SRC bash :exports results
cat data.csv
#+END_SRC

#+RESULTS: ingest_data
|   d |     t |
|   5 | -12.7 |
|  10 |   -11 |
|  15 |  -8.2 |
|  35 |  -6.5 |
| 110 |  -6.3 |
| 185 |  -5.9 |
| 300 |    -5 |
| 375 |  -4.2 |
| 450 |  -3.7 |
| 490 |  -2.4 |
| 495 |  -5.5 |

